# BendingDetailTypeSegmentLengthDimensionsForHooksEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeSegmentLengthDimensionsForHooksEnabled Property
ParameterTypeId Class See Also
---
"Hook Lengths"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsForHooksEnabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthDimensionsForHooksEnabled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthDimensionsForHooksEnabled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace